## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.azurerm_key_vault.current_key will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "current_key" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "vj-rcm-dev-kv"
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + resource_group_name             = "vj-rcm-dev-rg"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)
    }

  # data.azurerm_key_vault_secret.current_adls_secret will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_secret" "current_adls_secret" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "vj-adls-access-key-dev"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # azuread_application_registration.rcm_adf_app will be destroyed
  # (because azuread_application_registration.rcm_adf_app is not in configuration)
  - resource "azuread_application_registration" "rcm_adf_app" {
      - client_id                              = "bbb576b1-0e87-4626-afaf-2e27d1ffff69" -> null
      - disabled_by_microsoft                  = "map[false:]" -> null
      - display_name                           = "vj-rcm-dev-adf-app" -> null
      - id                                     = "/applications/ae67b1ee-6d97-40d9-88a9-093ae6f3fd1a" -> null
      - implicit_access_token_issuance_enabled = false -> null
      - implicit_id_token_issuance_enabled     = false -> null
      - object_id                              = "ae67b1ee-6d97-40d9-88a9-093ae6f3fd1a" -> null
      - publisher_domain                       = "vijaykrishnavk94gmail.onmicrosoft.com" -> null
      - requested_access_token_version         = 2 -> null
      - sign_in_audience                       = "AzureADMyOrg" -> null
        # (9 unchanged attributes hidden)
    }

  # azuread_application_registration.rcm_adls_app will be destroyed
  # (because azuread_application_registration.rcm_adls_app is not in configuration)
  - resource "azuread_application_registration" "rcm_adls_app" {
      - client_id                              = "16e4796d-64d7-4ba4-84d0-ef9a4edb09b1" -> null
      - disabled_by_microsoft                  = "map[false:]" -> null
      - display_name                           = "vj-rcm-dev-adls-app" -> null
      - id                                     = "/applications/ad470ce7-06a3-4975-bdc2-9d2ccb4e12ae" -> null
      - implicit_access_token_issuance_enabled = false -> null
      - implicit_id_token_issuance_enabled     = false -> null
      - object_id                              = "ad470ce7-06a3-4975-bdc2-9d2ccb4e12ae" -> null
      - publisher_domain                       = "vijaykrishnavk94gmail.onmicrosoft.com" -> null
      - requested_access_token_version         = 2 -> null
      - sign_in_audience                       = "AzureADMyOrg" -> null
        # (9 unchanged attributes hidden)
    }

  # azuread_service_principal.azure_adf_sp will be destroyed
  # (because azuread_service_principal.azure_adf_sp is not in configuration)
  - resource "azuread_service_principal" "azure_adf_sp" {
      - account_enabled               = true -> null
      - app_role_assignment_required  = false -> null
      - app_role_ids                  = {} -> null
      - app_roles                     = [] -> null
      - application_tenant_id         = "314aacf1-9610-4c50-bf5a-8ce5f8010819" -> null
      - client_id                     = "bbb576b1-0e87-4626-afaf-2e27d1ffff69" -> null
      - display_name                  = "vj-rcm-dev-adf-app" -> null
      - id                            = "/servicePrincipals/20db7754-b6f6-4833-b6c0-fcc11dd6a643" -> null
      - oauth2_permission_scope_ids   = {} -> null
      - oauth2_permission_scopes      = [] -> null
      - object_id                     = "20db7754-b6f6-4833-b6c0-fcc11dd6a643" -> null
      - redirect_uris                 = [] -> null
      - service_principal_names       = [] -> null
      - sign_in_audience              = "AzureADMyOrg" -> null
      - tags                          = [] -> null
      - type                          = "Application" -> null
      - use_existing                  = true -> null
        # (7 unchanged attributes hidden)

      - feature_tags {
          - custom_single_sign_on = false -> null
          - enterprise            = false -> null
          - gallery               = false -> null
          - hide                  = false -> null
        }

      - features {
          - custom_single_sign_on_app = false -> null
          - enterprise_application    = false -> null
          - gallery_application       = false -> null
          - visible_to_users          = true -> null
        }

      - saml_single_sign_on {
            # (1 unchanged attribute hidden)
        }
    }

  # azuread_service_principal.azure_adls_sp will be destroyed
  # (because azuread_service_principal.azure_adls_sp is not in configuration)
  - resource "azuread_service_principal" "azure_adls_sp" {
      - account_enabled               = true -> null
      - app_role_assignment_required  = false -> null
      - app_role_ids                  = {} -> null
      - app_roles                     = [] -> null
      - application_tenant_id         = "314aacf1-9610-4c50-bf5a-8ce5f8010819" -> null
      - client_id                     = "16e4796d-64d7-4ba4-84d0-ef9a4edb09b1" -> null
      - display_name                  = "vj-rcm-dev-adls-app" -> null
      - id                            = "/servicePrincipals/a12a2a84-506b-4eca-9e3b-1d1ca4aa8f2d" -> null
      - oauth2_permission_scope_ids   = {} -> null
      - oauth2_permission_scopes      = [] -> null
      - object_id                     = "a12a2a84-506b-4eca-9e3b-1d1ca4aa8f2d" -> null
      - redirect_uris                 = [] -> null
      - service_principal_names       = [] -> null
      - sign_in_audience              = "AzureADMyOrg" -> null
      - tags                          = [] -> null
      - type                          = "Application" -> null
      - use_existing                  = true -> null
        # (7 unchanged attributes hidden)

      - feature_tags {
          - custom_single_sign_on = false -> null
          - enterprise            = false -> null
          - gallery               = false -> null
          - hide                  = false -> null
        }

      - features {
          - custom_single_sign_on_app = false -> null
          - enterprise_application    = false -> null
          - gallery_application       = false -> null
          - visible_to_users          = true -> null
        }

      - saml_single_sign_on {
            # (1 unchanged attribute hidden)
        }
    }

  # azurerm_data_factory_linked_service_data_lake_storage_gen2.rcm_adls_ls will be updated in-place
  ~ resource "azurerm_data_factory_linked_service_data_lake_storage_gen2" "rcm_adls_ls" {
        id                    = "/subscriptions/71458d97-9dd7-48da-8513-2222c61f78bf/resourceGroups/vj-rcm-dev-rg/providers/Microsoft.DataFactory/factories/vj-rcm-dev-adf/linkedservices/vj-rcm-dev-adls-ls"
        name                  = "vj-rcm-dev-adls-ls"
      ~ storage_account_key   = (sensitive value)
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault.rcm_kv will be updated in-place
  ~ resource "azurerm_key_vault" "rcm_kv" {
      ~ access_policy                   = [
            {
                application_id          = null
                certificate_permissions = []
                key_permissions         = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "Decrypt",
                    "Encrypt",
                    "UnwrapKey",
                    "WrapKey",
                    "Verify",
                    "Sign",
                    "Purge",
                    "Release",
                    "Rotate",
                    "GetRotationPolicy",
                    "SetRotationPolicy",
                ]
                object_id               = "68469a57-c1fd-46d1-ba9c-c42616f8ea86"
                secret_permissions      = [
                    "Get",
                    "List",
                    "Set",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "Purge",
                ]
                storage_permissions     = [
                    "Backup",
                    "Delete",
                    "DeleteSAS",
                    "Get",
                    "GetSAS",
                    "List",
                    "ListSAS",
                    "Purge",
                    "Recover",
                    "RegenerateKey",
                    "Restore",
                    "Set",
                    "SetSAS",
                    "Update",
                ]
                tenant_id               = "314aacf1-9610-4c50-bf5a-8ce5f8010819"
            },
          - {
              - certificate_permissions = []
              - key_permissions         = [
                  - "Get",
                  - "List",
                  - "Update",
                  - "Create",
                  - "Import",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                  - "Decrypt",
                  - "Encrypt",
                  - "UnwrapKey",
                  - "WrapKey",
                  - "Verify",
                  - "Sign",
                  - "Purge",
                ]
              - object_id               = "6f0da0b0-27bb-4601-a4ed-81d234b09d39"
              - secret_permissions      = [
                  - "Get",
                  - "List",
                  - "Set",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                  - "Purge",
                ]
              - storage_permissions     = []
              - tenant_id               = "314aacf1-9610-4c50-bf5a-8ce5f8010819"
                # (1 unchanged attribute hidden)
            },
          - {
              - certificate_permissions = []
              - key_permissions         = [
                  - "Get",
                  - "List",
                  - "UnwrapKey",
                  - "WrapKey",
                ]
              - object_id               = "a12a2a84-506b-4eca-9e3b-1d1ca4aa8f2d"
              - secret_permissions      = [
                  - "Get",
                  - "List",
                ]
              - storage_permissions     = []
              - tenant_id               = "314aacf1-9610-4c50-bf5a-8ce5f8010819"
                # (1 unchanged attribute hidden)
            },
          - {
              - certificate_permissions = []
              - key_permissions         = [
                  - "Get",
                  - "List",
                  - "Update",
                  - "Create",
                  - "Import",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                  - "Decrypt",
                  - "Encrypt",
                  - "UnwrapKey",
                  - "WrapKey",
                  - "Verify",
                  - "Sign",
                  - "Purge",
                ]
              - object_id               = "20db7754-b6f6-4833-b6c0-fcc11dd6a643"
              - secret_permissions      = [
                  - "Get",
                  - "List",
                  - "Set",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                  - "Purge",
                ]
              - storage_permissions     = []
              - tenant_id               = "314aacf1-9610-4c50-bf5a-8ce5f8010819"
                # (1 unchanged attribute hidden)
            },
        ]
        id                              = "/subscriptions/71458d97-9dd7-48da-8513-2222c61f78bf/resourceGroups/vj-rcm-dev-rg/providers/Microsoft.KeyVault/vaults/vj-rcm-dev-kv"
        name                            = "vj-rcm-dev-kv"
        tags                            = {}
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_key_vault_access_policy.rcm-adf-mi will be destroyed
  # (because azurerm_key_vault_access_policy.rcm-adf-mi is not in configuration)
  - resource "azurerm_key_vault_access_policy" "rcm-adf-mi" {
      - id                 = "/subscriptions/71458d97-9dd7-48da-8513-2222c61f78bf/resourceGroups/vj-rcm-dev-rg/providers/Microsoft.KeyVault/vaults/vj-rcm-dev-kv/objectId/6f0da0b0-27bb-4601-a4ed-81d234b09d39" -> null
      - key_permissions    = [
          - "Get",
          - "List",
          - "Update",
          - "Create",
          - "Import",
          - "Delete",
          - "Recover",
          - "Backup",
          - "Restore",
          - "Decrypt",
          - "Encrypt",
          - "UnwrapKey",
          - "WrapKey",
          - "Verify",
          - "Sign",
          - "Purge",
        ] -> null
      - key_vault_id       = "/subscriptions/71458d97-9dd7-48da-8513-2222c61f78bf/resourceGroups/vj-rcm-dev-rg/providers/Microsoft.KeyVault/vaults/vj-rcm-dev-kv" -> null
      - object_id          = "6f0da0b0-27bb-4601-a4ed-81d234b09d39" -> null
      - secret_permissions = [
          - "Get",
          - "List",
          - "Set",
          - "Delete",
          - "Recover",
          - "Backup",
          - "Restore",
          - "Purge",
        ] -> null
      - tenant_id          = "314aacf1-9610-4c50-bf5a-8ce5f8010819" -> null
    }

  # azurerm_key_vault_access_policy.rcm-adf-principal will be destroyed
  # (because azurerm_key_vault_access_policy.rcm-adf-principal is not in configuration)
  - resource "azurerm_key_vault_access_policy" "rcm-adf-principal" {
      - id                 = "/subscriptions/71458d97-9dd7-48da-8513-2222c61f78bf/resourceGroups/vj-rcm-dev-rg/providers/Microsoft.KeyVault/vaults/vj-rcm-dev-kv/objectId/20db7754-b6f6-4833-b6c0-fcc11dd6a643" -> null
      - key_permissions    = [
          - "Get",
          - "List",
          - "Update",
          - "Create",
          - "Import",
          - "Delete",
          - "Recover",
          - "Backup",
          - "Restore",
          - "Decrypt",
          - "Encrypt",
          - "UnwrapKey",
          - "WrapKey",
          - "Verify",
          - "Sign",
          - "Purge",
        ] -> null
      - key_vault_id       = "/subscriptions/71458d97-9dd7-48da-8513-2222c61f78bf/resourceGroups/vj-rcm-dev-rg/providers/Microsoft.KeyVault/vaults/vj-rcm-dev-kv" -> null
      - object_id          = "20db7754-b6f6-4833-b6c0-fcc11dd6a643" -> null
      - secret_permissions = [
          - "Get",
          - "List",
          - "Set",
          - "Delete",
          - "Recover",
          - "Backup",
          - "Restore",
          - "Purge",
        ] -> null
      - tenant_id          = "314aacf1-9610-4c50-bf5a-8ce5f8010819" -> null
    }

  # azurerm_key_vault_access_policy.rcm-adls-principal will be destroyed
  # (because azurerm_key_vault_access_policy.rcm-adls-principal is not in configuration)
  - resource "azurerm_key_vault_access_policy" "rcm-adls-principal" {
      - id                 = "/subscriptions/71458d97-9dd7-48da-8513-2222c61f78bf/resourceGroups/vj-rcm-dev-rg/providers/Microsoft.KeyVault/vaults/vj-rcm-dev-kv/objectId/a12a2a84-506b-4eca-9e3b-1d1ca4aa8f2d" -> null
      - key_permissions    = [
          - "Get",
          - "List",
          - "UnwrapKey",
          - "WrapKey",
        ] -> null
      - key_vault_id       = "/subscriptions/71458d97-9dd7-48da-8513-2222c61f78bf/resourceGroups/vj-rcm-dev-rg/providers/Microsoft.KeyVault/vaults/vj-rcm-dev-kv" -> null
      - object_id          = "a12a2a84-506b-4eca-9e3b-1d1ca4aa8f2d" -> null
      - secret_permissions = [
          - "Get",
          - "List",
        ] -> null
      - tenant_id          = "314aacf1-9610-4c50-bf5a-8ce5f8010819" -> null
    }

Plan: 0 to add, 2 to change, 7 to destroy.
```
</details>